web/app/Controllers/API/User.php

    public function register()
    {
        $rules = [
            'firstname' => 'required',
            'lastname' => 'required',
            'email' => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.email]',
            'username' => 'required|min_length[6]|max_length[50]|is_unique[users.username]',
            'password' => 'required|min_length[6]|max_length[255]'
        ];

        $errors = [
            'email' => [
                'is_unique' => 'This email address is already registered.',
            ],
            'username' => [
                'is_unique' => 'This username is already taken.'
            ]
        ];

        $input = $this->getRequestInput($this->request);
        if (!$this->validateRequest($input, $rules, $errors)) {
            return $this->getResponse(
                        $this->validator->getErrors(),
                        ResponseInterface::HTTP_BAD_REQUEST
                );
        }

        $userModel = new UserModel();
        $userModel->save($input);
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `username`) VALUES ('asad', 'malik', 'nobody@gmail.com', '$2y$10$43lqAW1EmMXL9/grfyd9U.AJsaQN4HDRqHrb.IGXwfoWUULjrI.6m', 'nobody5')